MOVE SPACES TO WS-AREA.

IF WS-CONDITION = SPACES THEN
    MOVE 'DEFAULT-VALUE' TO WS-OUTPUT.
ELSE
    IF WS-CONDITION = 'TRUE' THEN
        MOVE 'VALUE1' TO WS-OUTPUT.
    ELSE
        MOVE 'VALUE2' TO WS-OUTPUT.
    END-IF
END-IF.

DISPLAY WS-OUTPUT.